tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "teamookla/speedtest"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# GNU compiler collection
brew "gcc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console Matrix
brew "cmatrix"
# Pack, ship and run any application as a lightweight container
brew "docker"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Fast, highly customisable system info script
brew "neofetch"
# Utility for managing network connections
brew "netcat"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Cryptographic recipes and primitives for Python
brew "python-cryptography"
# Software environment for statistical computing
brew "r", link: false
# Cross-shell prompt for astronauts
brew "starship"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
brew "hudochenkov/sshpass/sshpass"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Enable Windows-like alt-tab
cask "alt-tab"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Tool to measure the computer system's performance
cask "geekbench"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Utility that shows the latest app updates
cask "latest"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Environment for statistical computing and graphics
cask "r"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Data science software focusing on R and Python
cask "rstudio"
# Team communication and collaboration software
cask "slack"
# Control your Sonos system
cask "sonos"
# Music streaming service
cask "spotify"
# Create, edit, browse SQLite databases
cask "sqlitestudio"
# System monitor for the menu bar
cask "stats"
# Open-source BitTorrent client
cask "transmission"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# Tool to hide menu bar icons
cask "vanilla"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Collect, organise, cite, and share research sources
cask "zotero"
# Visual Studio Code
cask "visual-studio-code"
mas "2048 Game", id: 871033113
mas "AdGuard for Safari", id: 1440147259
mas "Be Focused", id: 973134470
mas "Bitwarden", id: 1352778147
mas "Disk Speed Test", id: 425264550
mas "Fantastical", id: 975937182
mas "Flappy Golf 2", id: 1154174205
mas "Home Assistant", id: 1099568401
mas "Hop", id: 1092825540
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Octagon", id: 691956219
mas "Octagon 2", id: 1493415019
mas "Pages", id: 409201541
mas "QuickShade", id: 931571202
mas "Speedtest", id: 1153157709
mas "Sudoku", id: 1489692148
mas "Sudoku 9x9", id: 903089432
mas "Super Stickman Golf 3", id: 1071253172
mas "Tailscale", id: 1475387142
mas "Telegram", id: 747648890
mas "Trello", id: 1278508951
mas "Unsplash Wallpapers", id: 1284863847
mas "WhatsApp", id: 1147396723
mas "WireGuard", id: 1451685025
vscode "akamud.vscode-theme-onedark"
vscode "bbenoist.vagrant"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "davidanson.vscode-markdownlint"
vscode "deondigital.csl-support"
vscode "dmitrydorofeev.empty-indent"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fnando.linter"
vscode "george-alisson.html-preview-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "igorjrd.cslpreview"
vscode "janne252.fontawesome-autocomplete"
vscode "keesschollaart.vscode-home-assistant"
vscode "kevinrose.vsc-python-indent"
vscode "killalau.vscode-liquid-snippets"
vscode "kirchner-trevor.shopify-liquid-preview"
vscode "kylebarron.stata-enhanced"
vscode "lukas-tr.materialdesignicons-intellisense"
vscode "marcostazi.vs-code-vagrantfile"
vscode "mdob2k.stata-language"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "neilding.language-liquid"
vscode "oderwat.indent-rainbow"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "samuelcolvin.jinjahtml"
vscode "sandorengholm.csspreview"
vscode "searking.preview-vscode"
vscode "sissel.shopify-liquid"
vscode "smoore.yaml-path"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
vscode "vscode-icons-team.vscode-icons"
vscode "wholroyd.jinja"
